

---



---
## Developed Dataset to show working


---



---

In [ ]:
pd.read_csv("/content/form_data.csv")

     CUST_ID  age         workclass  ... native-country  income       city
0     C10001   25           Private  ...          India  307000      Vizag
1     C10002   38           Private  ...          India  115000  Bengaluru
2     C10003   28         Local-gov  ...          India  188000      Vizag
3     C10004   44           Private  ...          India  468000  Ahmedabad
4     C10005   18           Private  ...          India  472000  Ahmedabad
...      ...  ...               ...  ...            ...     ...        ...
8945  C19186   39      Self-emp-inc  ...          India  416000      Delhi
8946  C19187   52           Private  ...          India  354000     Mumbai
8947  C19188   21         State-gov  ...          India  310000    Lucknow
8948  C19189   57  Self-emp-not-inc  ...          India   76000    Lucknow
8949  C19190   71  Self-emp-not-inc  ...          India  476000      Vizag

[8950 rows x 12 columns]


### Preparing some Test examples

In [180]:
N = np.random.randint(1000,8000)
test = data.iloc[N:N+5,1:].reset_index().drop(['index'],axis=1)
test = pd.concat([pd.DataFrame({'CUST_ID':['D21000','D21001','D21002','D21003','D21004']}),test], axis=1)
test

  CUST_ID  age  workclass  ... native-country  income       city
0  D21000   46          0  ...          India  340000  Bengaluru
1  D21001   36          0  ...         Mexico  206000     Mumbai
2  D21002   45          4  ...          India  126000    Lucknow
3  D21003   19          4  ...          India  278000      Patna
4  D21004   38          0  ...          India  120000      Delhi

[5 rows x 12 columns]



---



---
# CODE


---



---

In [181]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.neighbors import NearestNeighbors

import warnings
warnings.filterwarnings(action="ignore")

import os

In [204]:
class member_updater():

  def access_proc_data(self, path):
    self.procdf = pd.read_csv(path)
    return self.procdf.head()
  
  def access_form_data(self, path):
    self.formdf = pd.read_csv(path)
    return self.formdf.head()

  def train(self):
    self.data = self.formdf.copy()
    self.data.workclass = pd.factorize(self.data.workclass)[0]
    self.data.education = pd.factorize(self.data.education)[0]
    self.data['marital-status'] = pd.factorize(self.data['marital-status'])[0]
    self.data.occupation = pd.factorize(self.data.occupation)[0]
    self.data.gender = pd.factorize(self.data.gender)[0]
    self.data['native-country'] = pd.factorize(self.data['native-country'])[0]
    self.data.city = pd.factorize(self.data.city)[0]
    
    X = np.array(self.data)[:,1:]
    self.nbrs = NearestNeighbors(n_neighbors=1, algorithm='ball_tree').fit(X)

  def predict(self, test):
    test.workclass = pd.factorize(test.workclass)[0]
    test.education = pd.factorize(test.education)[0]
    test['marital-status'] = pd.factorize(test['marital-status'])[0]
    test.occupation = pd.factorize(test.occupation)[0]
    test.gender = pd.factorize(test.gender)[0]
    test['native-country'] = pd.factorize(test['native-country'])[0]
    test.city = pd.factorize(test.city)[0]
    distances, indices = self.nbrs.kneighbors(test.iloc[:,1:])
    self.dff = pd.DataFrame()
    for x in indices:
      self.dff = pd.concat([self.dff, self.procdf.iloc[x,1:]], axis=0)
    self.dff = pd.concat([pd.DataFrame(test.iloc[:,0]),self.dff.reset_index().drop(['index'],axis=1)], axis=1)
    return self.dff

  def update(self, save_filepath):
    newdf = pd.concat([self.procdf, self.dff], axis=0)
    newdf.to_csv(save_filepath, index=None)



---



---


# How to Use:


---



---

In [205]:
obj = member_updater()

In [206]:
obj.access_proc_data('/content/processed_data.csv')

  CUST_ID  TENURE  ...  PURCHASES_TRX_RANGE  CASH_ADVANCE_TRX_RANGE
0  C10001      12  ...                    1                       0
1  C10002      12  ...                    0                       1
2  C10003      12  ...                    3                       0
3  C10004      12  ...                    1                       1
4  C10005      12  ...                    1                       0

[5 rows x 18 columns]

In [207]:
obj.access_form_data('/content/form_data.csv')

  CUST_ID  age  workclass  ... native-country  income       city
0  C10001   25    Private  ...          India  307000      Vizag
1  C10002   38    Private  ...          India  115000  Bengaluru
2  C10003   28  Local-gov  ...          India  188000      Vizag
3  C10004   44    Private  ...          India  468000  Ahmedabad
4  C10005   18    Private  ...          India  472000  Ahmedabad

[5 rows x 12 columns]

In [208]:
obj.train()

In [209]:
test

  CUST_ID  age  workclass  ...  native-country  income  city
0  D21000   46          0  ...               0  340000     0
1  D21001   36          0  ...               1  206000     1
2  D21002   45          1  ...               0  126000     2
3  D21003   19          1  ...               0  278000     3
4  D21004   38          0  ...               0  120000     4

[5 rows x 12 columns]

In [210]:
obj.predict(test)

  CUST_ID  TENURE  ...  PURCHASES_TRX_RANGE  CASH_ADVANCE_TRX_RANGE
0  D21000      11  ...                    1                       0
1  D21001      12  ...                    6                       5
2  D21002      12  ...                    1                       0
3  D21003      12  ...                    3                       0
4  D21004      12  ...                    3                       0

[5 rows x 18 columns]

In [211]:
obj.update('/content/updated_data.csv')